In [58]:
#importing the libraries
import os
import pandas as pd 
import mysql.connector

from sqlalchemy import create_engine
from urllib.parse import quote_plus

# Data 1

In [59]:
#loading the dataset
data = pd.read_csv("data.csv")

In [60]:
#displaying the dataset
data.head()

,Year,Month,Inflation Rate (%),CPI,Food CPI,Exchange Rate\n (KES/USD),Interest Rate (%)
0,2025,February,3.5,143.12,118.0,128.70,10.75
1,2025,January,3.3,142.68,116.1,129.00,11.25
2,2024,December,3.0,141.66,120.4,128.85,11.25
3,2024,November,2.8,140.81,120.7,129.50,12.00
4,2024,October,2.7,140.44,119.9,128.50,12.00

In [61]:

# List to store cleaned DataFrames
dfs = []

# Standardize column names
data.columns = data.columns.str.strip().str.lower()

# Rename columns to match MySQL table (modify as needed)
column_mapping = {
    "Year": "year",
    "Inflation Rate (%)": "inflation_rate",
    "Month": "month",
    "CPI": "general_cpi",
    "Food CPI": "food_cpi",
    "Exchange Rate (KES/USD": "kes_to_usd",
    "Interest Rate (%)": "interest_rate",
}
data.rename(columns=column_mapping, inplace=True)

# Append cleaned dataframe
dfs.append(data)

# Combine all cleaned data into one DataFrame
data = pd.concat(dfs, ignore_index=True)

# Check data consistency
print(data.dtypes)
print(data.head())

year                           int64
month                         object
inflation rate (%)           float64
cpi                          float64
food cpi                     float64
exchange rate\n (kes/usd)    float64
interest rate (%)            float64
dtype: object
   year     month  inflation rate (%)     cpi  food cpi  \
0  2025  February                 3.5  143.12     118.0
1  2025   January                 3.3  142.68     116.1
2  2024  December                 3.0  141.66     120.4
3  2024  November                 2.8  140.81     120.7
4  2024   October                 2.7  140.44     119.9

   exchange rate\n (kes/usd)  interest rate (%)
0                     128.70              10.75
1                     129.00              11.25
2                     128.85              11.25
3                     129.50              12.00
4                     128.50              12.00

### Cleaning the data 1

In [62]:
#checking for duplicates
data.duplicated().sum()

np.int64(0)

There are no duplicates in data 1

In [63]:
#checking for null values
data.isnull().sum()

year                         0
month                        0
inflation rate (%)           0
cpi                          0
food cpi                     0
exchange rate\n (kes/usd)    0
interest rate (%)            0
dtype: int64

There are no null values in the data dataset

In [64]:
#displaying the data dataset
data.head()

,year,month,inflation rate (%),cpi,food cpi,exchange rate\n (kes/usd),interest rate (%)
0,2025,February,3.5,143.12,118.0,128.70,10.75
1,2025,January,3.3,142.68,116.1,129.00,11.25
2,2024,December,3.0,141.66,120.4,128.85,11.25
3,2024,November,2.8,140.81,120.7,129.50,12.00
4,2024,October,2.7,140.44,119.9,128.50,12.00

# Data2

In [65]:
#loading the datasets
data2 = pd.read_csv("data2.csv")

In [66]:
#displaying the dataset
data2.head()

   Year Quarter  GDP Growth Rate (%)  GDP Value (KES Billion)
0  2025      Q1                  NaN                      NaN
1  2025      Q2                  NaN                      NaN
2  2025      Q3                  NaN                      NaN
3  2025      Q4                  NaN                      NaN
4  2024      Q1                  5.3                  14000.0

In [67]:
# List to store cleaned DataFrames
dfs = []

# Standardize column names
data2.columns = data2.columns.str.strip().str.lower()

# Rename columns to match MySQL table (modify as needed)
column_mapping = {
    "Year": "year",
    "Month": "month",
    "CPI": "general_cpi",
    "Food CPI": "food_cpi",
    "Exchange Rate (KES/USD": "kes_to_usd",
    "Interest Rate (%)": "interest_rate",
}
data2.rename(columns=column_mapping, inplace=True)

# Append cleaned dataframe
dfs.append(data2)

# Combine all cleaned data into one DataFrame
data2 = pd.concat(dfs, ignore_index=True)

# Check data consistency
print(data2.dtypes)
print(data2.head())

year                         int64
quarter                     object
gdp growth rate (%)        float64
gdp value (kes billion)    float64
dtype: object
   year quarter  gdp growth rate (%)  gdp value (kes billion)
0  2025      Q1                  NaN                      NaN
1  2025      Q2                  NaN                      NaN
2  2025      Q3                  NaN                      NaN
3  2025      Q4                  NaN                      NaN
4  2024      Q1                  5.3                  14000.0

### Cleaning the data2

In [68]:
#checking for duplicates
data2.duplicated().sum()

np.int64(0)

There are no duplicates in data2

In [69]:
#checking for null values
data2.isnull().sum()

year                       0
quarter                    0
gdp growth rate (%)        4
gdp value (kes billion)    4
dtype: int64

There are 4 null values in gdp growth rate (%) column.

There are 4 null values in gdp value (kes billion).

The null values won't be dropped for future filling.

In [70]:
#displaying the data2 dataset
data2.head()

   year quarter  gdp growth rate (%)  gdp value (kes billion)
0  2025      Q1                  NaN                      NaN
1  2025      Q2                  NaN                      NaN
2  2025      Q3                  NaN                      NaN
3  2025      Q4                  NaN                      NaN
4  2024      Q1                  5.3                  14000.0

# Data3

In [71]:
#loading the datasets
data3 = pd.read_csv("data3.csv")

In [72]:
#displaying the dataset
data3.head()

   Year Quarter  VAT Rate (%) PAYE Bracket (KES)  Tax Rate (%)
0  2025      Q1            16         0 – 24,000          10.0
1  2025      Q1            16    24,001 – 32,333          15.0
2  2025      Q1            16   32,334 – 500,000          25.0
3  2025      Q1            16  500,001 – 800,000          30.0
4  2025      Q1            16      Above 800,000          35.0

In [73]:
# List to store cleaned DataFrames
dfs = []

# Standardize column names
data3.columns = data3.columns.str.strip().str.lower()

# Rename columns to match MySQL table (modify as needed)
column_mapping = {
    "Year": "year",
    "Month": "month",
    "CPI": "general_cpi",
    "Food CPI": "food_cpi",
    "Exchange Rate (KES/USD": "kes_to_usd",
    "Interest Rate (%)": "interest_rate",
}
data3.rename(columns=column_mapping, inplace=True)

# Append cleaned dataframe
dfs.append(data3)

# Combine all cleaned data into one DataFrame
data3 = pd.concat(dfs, ignore_index=True)

# Check data consistency
print(data3.dtypes)
print(data3.head())

year                    int64
quarter                object
vat rate (%)            int64
paye bracket (kes)     object
tax rate (%)          float64
dtype: object
   year quarter  vat rate (%) paye bracket (kes)  tax rate (%)
0  2025      Q1            16         0 – 24,000          10.0
1  2025      Q1            16    24,001 – 32,333          15.0
2  2025      Q1            16   32,334 – 500,000          25.0
3  2025      Q1            16  500,001 – 800,000          30.0
4  2025      Q1            16      Above 800,000          35.0

### Cleaning data3

In [74]:
#checking for duplicates
data3.duplicated().sum()

np.int64(0)

There are no duplicates in the data3 dataset

In [75]:
#checking for null values
data3.isnull().sum()

year                  0
quarter               0
vat rate (%)          0
paye bracket (kes)    0
tax rate (%)          0
dtype: int64

There are no null values in the data3 dataset.

In [76]:
#displaying the data3 dataset
data3.head()

   year quarter  vat rate (%) paye bracket (kes)  tax rate (%)
0  2025      Q1            16         0 – 24,000          10.0
1  2025      Q1            16    24,001 – 32,333          15.0
2  2025      Q1            16   32,334 – 500,000          25.0
3  2025      Q1            16  500,001 – 800,000          30.0
4  2025      Q1            16      Above 800,000          35.0

# Data4

In [77]:
#loading the datasets
data4 = pd.read_csv("data4.csv")

In [78]:
#displaying the dataset
data4.head()

   Year  Unemployment Rate (%)
0   2025                   NaN
1   2024                   NaN
2   2023                 5.68%
3   2022                 5.81%
4   2021                 5.69%

In [79]:
# List to store cleaned DataFrames
dfs = []

# Standardize column names
data4.columns = data4.columns.str.strip().str.lower()

# Rename columns to match MySQL table (modify as needed)
column_mapping = {
    "Year": "year",
    "Month": "month",
    "CPI": "general_cpi",
    "Food CPI": "food_cpi",
    "Exchange Rate (KES/USD": "kes_to_usd",
    "Interest Rate (%)": "interest_rate",
}
data4.rename(columns=column_mapping, inplace=True)

# Append cleaned dataframe
dfs.append(data4)

# Combine all cleaned data into one DataFrame
data4 = pd.concat(dfs, ignore_index=True)

# Check data consistency
print(data4.dtypes)
print(data4.head())

year                      int64
unemployment rate (%)    object
dtype: object
   year unemployment rate (%)
0  2025                   NaN
1  2024                   NaN
2  2023                 5.68%
3  2022                 5.81%
4  2021                 5.69%

### Cleaning data4

In [80]:
#checking for duplicates
data4.duplicated().sum()

np.int64(0)

There are no duplicates in the data4 dataset

In [81]:
#checking for null values
data4.isnull().sum()

year                     0
unemployment rate (%)    2
dtype: int64

There are 2 null values from the unemployment rate (%).

The null values won't be dropped for future filling.

In [82]:
#displaying the data3 dataset
data4.head()

   year unemployment rate (%)
0  2025                   NaN
1  2024                   NaN
2  2023                 5.68%
3  2022                 5.81%
4  2021                 5.69%

# Connecting to MySQL server and database

In [83]:
# Connecting to MySQL server
conn = mysql.connector.connect(
    host="localhost",
    port=3306,
    user="root",
    password="Lovemeshally@2004"
)
cursor = conn.cursor()

In [84]:
# Connecting to the created database
conn.database = "Inflationdb"

Connected to the server and database.

# Creating tables

In [85]:
# Connecting to MySQL server
conn = mysql.connector.connect(
    host="localhost",
    port=3306,
    user="root",
    password="Lovemeshally@2004",
    database="inflationdb"
)
cursor = conn.cursor()

tables = [
    """CREATE TABLE IF NOT EXISTS cpi (
        id INT AUTO_INCREMENT PRIMARY KEY,
        year INT,
        month VARCHAR(20),
        inflation_rate FLOAT,
        general_cpi FLOAT,
        food_cpi FLOAT
    );""",
    
    """CREATE TABLE IF NOT EXISTS exchangerates (
        id INT AUTO_INCREMENT PRIMARY KEY,
        year INT,
        month VARCHAR(20),
        kes_to_usd FLOAT
    );""",

    """CREATE TABLE IF NOT EXISTS gdpgrowth (
       id INT AUTO_INCREMENT PRIMARY KEY,
       year INT,
       quarter ENUM('Q1', 'Q2', 'Q3', 'Q4') NOT NULL,
       gdp_growth FLOAT,
       gdp_value FLOAT
    );""",

    """CREATE TABLE IF NOT EXISTS interestrates (
        id INT AUTO_INCREMENT PRIMARY KEY,
        year INT,
        month VARCHAR(20),
        interest_rate FLOAT
    );""",

    """CREATE TABLE IF NOT EXISTS taxrates (
        id INT AUTO_INCREMENT PRIMARY KEY,
        year INT,
        quarter ENUM('Q1', 'Q2', 'Q3', 'Q4') NOT NULL,
        vat_rate DECIMAL(5,2) NOT NULL,  
        paye_bracket VARCHAR(50) NOT NULL, 
        tax_rate DECIMAL(5,2) NOT NULL 
    );""",

    """CREATE TABLE IF NOT EXISTS unemployment (
        id INT AUTO_INCREMENT PRIMARY KEY,
        year INT,
        unemployment_rate FLOAT
    );"""
]

# Creating tables
for table in tables:
    cursor.execute(table)
    
# Closing the cursor and connection after all tables are created
cursor.close()
conn.close()

print("Tables created successfully and connection closed.")

Tables created successfully and connection closed.

In [86]:
username = "MySQL80"
password = "Lovemeshally@2004"
encoded_password="Lovemeshally%402004"
host = "localhost"
port = "3306"
database = "inflationdb"

In [87]:
# MySQL connection string
engine = create_engine("mysql+mysqlconnector://root:Lovemeshally%402004@localhost:3306/inflationdb")

# Test connection
connection = engine.connect()
print("Connected successfully!")
connection.close()

Connected successfully!

In [88]:

# Mapping of table names to file paths
csv_files = {
    "cpi": "data.csv",
    "exchangerates": "data.csv",
    "interestrates": "data.csv",
    "gdpgrowth": "data2.csv",
    "taxrates": "data3.csv",
    "unemployment": "data4.csv"
}

# Load each CSV file into MySQL
for table_name, file_path in csv_files.items():
    try:
        # Read CSV
        df = pd.read_csv(file_path)

        # Standardize column names (strip spaces & lowercase)
        df.columns = df.columns.str.strip().str.lower()

        # Insert into MySQL
        df.to_sql(table_name, con=engine, if_exists="replace", index=False)
        print(f"✅ Data inserted into {table_name} successfully.")

    except Exception as e:
        print(f"❌ Error loading {file_path} into {table_name}: {e}")

C:\Users\Administrator\anaconda3\envs\learn-env\Lib\site-packages\pandas\io\sql.py:2059: SAWarning: Unknown column definition '  `exchange rate'
  self.meta.reflect(
C:\Users\Administrator\anaconda3\envs\learn-env\Lib\site-packages\pandas\io\sql.py:2059: SAWarning: Unknown schema content: ' (kes/usd)` double DEFAULT NULL,'
  self.meta.reflect(
C:\Users\Administrator\anaconda3\envs\learn-env\Lib\site-packages\pandas\io\sql.py:2059: SAWarning: Unknown column definition '  `exchange rate'
  self.meta.reflect(
C:\Users\Administrator\anaconda3\envs\learn-env\Lib\site-packages\pandas\io\sql.py:2059: SAWarning: Unknown schema content: ' (kes/usd)` double DEFAULT NULL,'
  self.meta.reflect(

✅ Data inserted into cpi successfully.
✅ Data inserted into exchangerates successfully.
✅ Data inserted into interestrates successfully.

C:\Users\Administrator\anaconda3\envs\learn-env\Lib\site-packages\pandas\io\sql.py:2059: SAWarning: Unknown column definition '  `exchange rate'
  self.meta.reflect(
C:\Users\Administrator\anaconda3\envs\learn-env\Lib\site-packages\pandas\io\sql.py:2059: SAWarning: Unknown schema content: ' (kes/usd)` double DEFAULT NULL,'
  self.meta.reflect(

✅ Data inserted into gdpgrowth successfully.
✅ Data inserted into taxrates successfully.
✅ Data inserted into unemployment successfully.

The data is inserted into the SQL tables

In [89]:
# Connecting to MySQL server
conn = mysql.connector.connect(
    host="localhost",
    port=3306,
    user="root",
    password="Lovemeshally@2004",
    database="inflationdb"
)
cursor = conn.cursor()

# Execute the DESCRIBE query
table_name = "cpi" 
cursor.execute(f"DESCRIBE {table_name}")

# Fetch and display the results
columns = cursor.fetchall()

# Print the column information
for column in columns:
    print(column)

# Close the cursor and connection
cursor.close()
conn.close()

('year', 'bigint', 'YES', '', None, '')
('month', 'text', 'YES', '', None, '')
('inflation rate (%)', 'double', 'YES', '', None, '')
('cpi', 'double', 'YES', '', None, '')
('food cpi', 'double', 'YES', '', None, '')
('exchange rate\n (kes/usd)', 'double', 'YES', '', None, '')
('interest rate (%)', 'double', 'YES', '', None, '')

In [90]:
# Connecting to MySQL server
conn = mysql.connector.connect(
    host="localhost",
    port=3306,
    user="root",
    password="Lovemeshally@2004",
    database="inflationdb"
)
cursor = conn.cursor()

# Execute the DESCRIBE query
table_name = "gdpgrowth" 
cursor.execute(f"DESCRIBE {table_name}")

# Fetch and display the results
columns = cursor.fetchall()

# Print the column information
for column in columns:
    print(column)

# Close the cursor and connection
cursor.close()
conn.close()

('year', 'bigint', 'YES', '', None, '')
('quarter', 'text', 'YES', '', None, '')
('gdp growth rate (%)', 'double', 'YES', '', None, '')
('gdp value (kes billion)', 'double', 'YES', '', None, '')

In [91]:
# Connecting to MySQL server
conn = mysql.connector.connect(
    host="localhost",
    port=3306,
    user="root",
    password="Lovemeshally@2004",
    database="inflationdb"
)
cursor = conn.cursor()

# Execute the DESCRIBE query
table_name = "taxrates" 
cursor.execute(f"DESCRIBE {table_name}")

# Fetch and display the results
columns = cursor.fetchall()

# Print the column information
for column in columns:
    print(column)

# Close the cursor and connection
cursor.close()
conn.close()

('year', 'bigint', 'YES', '', None, '')
('quarter', 'text', 'YES', '', None, '')
('vat rate (%)', 'bigint', 'YES', '', None, '')
('paye bracket (kes)', 'text', 'YES', '', None, '')
('tax rate (%)', 'double', 'YES', '', None, '')

In [92]:
# Connecting to MySQL server
conn = mysql.connector.connect(
    host="localhost",
    port=3306,
    user="root",
    password="Lovemeshally@2004",
    database="inflationdb"
)
cursor = conn.cursor()

# Execute the DESCRIBE query
table_name = "unemployment" 
cursor.execute(f"DESCRIBE {table_name}")

# Fetch and display the results
columns = cursor.fetchall()

# Print the column information
for column in columns:
    print(column)

# Close the cursor and connection
cursor.close()
conn.close()

('year', 'bigint', 'YES', '', None, '')
('unemployment rate (%)', 'text', 'YES', '', None, '')

The cpi, gdpgrowth, taxrates, and unemployment tables are successfully loaded into the inflatiodb

The database is exported and saved in the db_config.py whereby it is connect to the analysis notebook.